tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/cask-drivers"

cask_args appdir: "/Applications"

brew "ack"
brew "antigen"
brew "cask"
brew 'curl', link: true
brew "docker"
brew "libpng"
brew "fontconfig"
brew "fribidi"
brew "git-flow"
brew "lua"
brew "highlight"
brew 'nano', link: true
brew 'wget'
brew 'git'
brew 'python3'
brew "htop"
brew "iperf"
brew "lynx"
brew "maven"
brew "tree"
brew "yadm"
brew 'rsync'

brew "zsh"
brew "zsh-completions"

cask "adobe-acrobat-reader"
cask "bitwarden"
cask "intune-company-portal"
cask "eul"
cask "mattermost"
cask "nomad"
cask "teamviewer"
cask "telegram"
cask "whatsapp"
cask "spotify"
cask "virtualbox"
cask "vlc"
cask "balenaetcher"
cask 'sourcetree'
cask "clipy"
cask "firefox"
cask "google-chrome"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask 'visual-studio-code'
cask 'intellij-idea'
cask 'iterm2'
cask "microsoft-office"
cask 'java'

mas "Daily", id: 686910553
mas "CotEditor", id: 1024640650
mas "Magnet", id: 441258766
mas "Giphy", id: 668208984